Tekla Open API Reference for Tekla Structures 2025
RebarSplice.LapLength Property
 The lap length of the lap type splice.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double LapLength { get; set; }
Public Property LapLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarSplice Class
Tekla.Structures.Model Namespace